//0. Вывести квадрат числа

System.Console.Write ("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine($"Квадрат {number} = {number * number}");